esp-cpp/espp/components/esp-box/example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

# set compiler optimization level to -O2 (compile for performance)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# over twice as fast as DIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Custom partition table: the tabbed UI + microphone example no longer fits the
# 1 MB default app partition, so use a 6 MB factory app (see partitions.csv).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Set esp-timer task stack size to 6KB
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# set the functions into IRAM
CONFIG_SPI_MASTER_IN_IRAM=y

#
# LVGL configuration - # Themes
#
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=y
CONFIG_LV_THEME_DEFAULT_GROW=y
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=30

# PSRAM (octal PSRAM on the WROOM-1 R8 / R16V modules); used for the audio
# recording buffer in the example
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# catch task stack overflows immediately (debug watchpoint on the stack end)
# instead of letting them silently corrupt the heap
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
# The interrupt task (touch I2C) logs errors through the fmt color-print
# path, which needs more than the 4 KB BSP default; give it 8 KB here so a
# transient touch-bus error cannot overflow its stack. See the README.
CONFIG_ESP_BOX_INTERRUPT_STACK_SIZE=8192
